{"backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"data_format": "channels_last", "padding": "same", "filters": 16, "activation": "linear", "batch_input_shape": [null, 48, 48, 1], "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "kernel_size": [7, 7], "strides": [1, 1], "activity_regularizer": null, "trainable": true, "name": "image_array", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "bias_regularizer": null, "use_bias": true, "dtype": "float32"}}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_regularizer": null, "beta_constraint": null, "axis": -1, "gamma_constraint": null, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_1", "trainable": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "center": true}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "padding": "same", "filters": 16, "activation": "linear", "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "kernel_size": [7, 7], "strides": [1, 1], "kernel_regularizer": null, "trainable": true, "name": "conv2d_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "bias_regularizer": null, "use_bias": true}}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_regularizer": null, "beta_constraint": null, "axis": -1, "gamma_constraint": null, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_2", "trainable": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "center": true}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}}, {"class_name": "AveragePooling2D", "config": {"data_format": "channels_last", "strides": [2, 2], "padding": "same", "trainable": true, "name": "average_pooling2d_1", "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"noise_shape": null, "rate": 0.5, "seed": null, "trainable": true, "name": "dropout_1"}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "padding": "same", "filters": 32, "activation": "linear", "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "kernel_size": [5, 5], "strides": [1, 1], "kernel_regularizer": null, "trainable": true, "name": "conv2d_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "bias_regularizer": null, "use_bias": true}}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_regularizer": null, "beta_constraint": null, "axis": -1, "gamma_constraint": null, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_3", "trainable": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "center": true}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "padding": "same", "filters": 32, "activation": "linear", "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "kernel_size": [5, 5], "strides": [1, 1], "kernel_regularizer": null, "trainable": true, "name": "conv2d_3", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "bias_regularizer": null, "use_bias": true}}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_regularizer": null, "beta_constraint": null, "axis": -1, "gamma_constraint": null, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_4", "trainable": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "center": true}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}}, {"class_name": "AveragePooling2D", "config": {"data_format": "channels_last", "strides": [2, 2], "padding": "same", "trainable": true, "name": "average_pooling2d_2", "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"noise_shape": null, "rate": 0.5, "seed": null, "trainable": true, "name": "dropout_2"}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "padding": "same", "filters": 64, "activation": "linear", "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "kernel_size": [3, 3], "strides": [1, 1], "kernel_regularizer": null, "trainable": true, "name": "conv2d_4", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "bias_regularizer": null, "use_bias": true}}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_regularizer": null, "beta_constraint": null, "axis": -1, "gamma_constraint": null, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_5", "trainable": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "center": true}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "padding": "same", "filters": 64, "activation": "linear", "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "kernel_size": [3, 3], "strides": [1, 1], "kernel_regularizer": null, "trainable": true, "name": "conv2d_5", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "bias_regularizer": null, "use_bias": true}}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_regularizer": null, "beta_constraint": null, "axis": -1, "gamma_constraint": null, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_6", "trainable": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "center": true}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_3"}}, {"class_name": "AveragePooling2D", "config": {"data_format": "channels_last", "strides": [2, 2], "padding": "same", "trainable": true, "name": "average_pooling2d_3", "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"noise_shape": null, "rate": 0.5, "seed": null, "trainable": true, "name": "dropout_3"}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "padding": "same", "filters": 128, "activation": "linear", "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "kernel_size": [3, 3], "strides": [1, 1], "kernel_regularizer": null, "trainable": true, "name": "conv2d_6", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "bias_regularizer": null, "use_bias": true}}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_regularizer": null, "beta_constraint": null, "axis": -1, "gamma_constraint": null, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_7", "trainable": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "center": true}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "padding": "same", "filters": 128, "activation": "linear", "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "kernel_size": [3, 3], "strides": [1, 1], "kernel_regularizer": null, "trainable": true, "name": "conv2d_7", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "bias_regularizer": null, "use_bias": true}}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_regularizer": null, "beta_constraint": null, "axis": -1, "gamma_constraint": null, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_8", "trainable": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "center": true}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_4"}}, {"class_name": "AveragePooling2D", "config": {"data_format": "channels_last", "strides": [2, 2], "padding": "same", "trainable": true, "name": "average_pooling2d_4", "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"noise_shape": null, "rate": 0.5, "seed": null, "trainable": true, "name": "dropout_4"}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "padding": "same", "filters": 256, "activation": "linear", "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "kernel_size": [3, 3], "strides": [1, 1], "kernel_regularizer": null, "trainable": true, "name": "conv2d_8", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "bias_regularizer": null, "use_bias": true}}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_regularizer": null, "beta_constraint": null, "axis": -1, "gamma_constraint": null, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_9", "trainable": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "center": true}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "padding": "same", "filters": 7, "activation": "linear", "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "kernel_size": [3, 3], "strides": [1, 1], "kernel_regularizer": null, "trainable": true, "name": "conv2d_9", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "bias_regularizer": null, "use_bias": true}}, {"class_name": "GlobalAveragePooling2D", "config": {"data_format": "channels_last", "trainable": true, "name": "global_average_pooling2d_1"}}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "predictions"}}], "keras_version": "2.1.2"}